do

function run(msg, matches)
local reply_id = msg['id']
local poker = {'پوکر نگاییدم😐','پوکر نده جنده 😐😐','کیونی چرا پوکر میدی',
                  'کیرم تو پوکر😐','گاییدم😐',' نگاییدم😐',
                  'کیر خر پوکر نده😐',' نفر بعدی بوکر بده بن 😐','کیری پوک نده😐',
                  'مگه کونت گزاشتم پوکر میدی؟😐',' 😐',
                  'عمه اونی که پوکر داد رو گاییدم😐',
                  'بازم پوکر؟😐',' گه پوکر نبود تو چیکار میکردی؟😐',
                  'کون که نمیدی پوکر هم میدی؟😐',' کسی که کص یا شاخ نباشد حق فرستادن پوکر را ندارد😐','D:',
                  'نگاییدم😐'}

if matches[1] == '😐' then
    if not is_sudo(msg) then
return poker[math.random(#poker)]
end
end 
end
return {
patterns = {
    "😐"
},
run = run
}

end
